app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "posts" ("image_data", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @post = current_user.posts.build(post_params)
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "Description"], ["updated_at", "2020-09-14 18:11:25.753033"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def set_post
    @post = Post.find(params[:id])